var DATA_12   = { 5: 1, 6: 3, 7: 5, 8: 6, 9: 8, 10: 9, 11: 11, 12: 12 };
var DATA_9    = { 5: 1, 6: 2, 7: 3, 8: 4, 9: 5, 10: 6, 11:  8, 12:  9 };
var DATA_8    = { 5: 1, 6: 2, 7: 3, 8: 4, 9: 5, 10: 6, 11:  7, 12:  8 };
var DATA_6_1  = { 5: 1, 6: 2, 7: 3, 8: 3, 9: 3, 10: 4, 11:  5, 12:  6 };
var DATA_6_2  = { 5: 0, 6: 1, 7: 2, 8: 3, 9: 3, 10: 4, 11:  5, 12:  6 };
var DATA_4    = { 5: 0, 6: 1, 7: 1, 8: 2, 9: 2, 10: 3, 11:  3, 12:  4 };
var DATA_3    = { 5: 0, 6: 0, 7: 1, 8: 1, 9: 1, 10: 2, 11:  2, 12:  3 };
var DATA_2    = { 5: 0, 6: 0, 7: 1, 8: 1, 9: 1, 10: 1, 11:  1, 12:  2 };
var data = {
  '国語総合'                : DATA_12,
  '国語表現'                : DATA_9,
  '現代文A'                 : DATA_6_1,
  '現代文B'                 : DATA_12,
  '古典A'                   : DATA_6_1,
  '世界史B'                 : DATA_12,
  '日本史B'                 : DATA_12,
  '地理B'                   : DATA_12,
  '現代社会'                : DATA_6_1,
  '倫理'                    : DATA_6_1,
  '政治・経済'              : DATA_6_1,
  '数学1'                   : DATA_9,
  '数学2'                   : DATA_12,
  '数学A'                   : DATA_6_1,
  '数学B'                   : DATA_6_1,
  '科学と人間生活'          : DATA_6_1,
  '物理基礎'                : DATA_6_1,
  '化学基礎'                : DATA_6_1,
  '生物基礎'                : DATA_6_1,
  '地学基礎'                : DATA_6_1,
  '体育1'                   : DATA_2,
  '体育2'                   : DATA_3,
  '体育3'                   : DATA_2,
  '保健'                    : DATA_6_2,
  '美術1'                   : DATA_6_2,
  'コミュニケーション英語1' : DATA_9,
  'コミュニケーション英語2' : DATA_12,
  '英語表現1'               : DATA_6_1,
  '英語会話'                : DATA_6_1,
  '家庭基礎'                : DATA_4,
  '家庭総合'                : DATA_8,
  '社会と情報'              : DATA_4,
  '情報の科学'              : DATA_4,
  // ???
  '総合的な学習1': {}
};
var months = [4, 5, 6, 7, 8, 9, 10, 11, 12];
var months_rest = months.slice((new Date()).getMonth() - 3);
